[{"title": "Texas Apple store closes due to COVID-19 outbreak", "content": "Apple has generally been cautious in dealing with COVID-19 even as it loosens store policies, but that apparently wasn't enough to prevent an outbreak among staff. NBC Newsreports the Apple store in … [+1463 chars]", "url": "https://www.engadget.com/apple-store-covid-19-outbreak-221248408.html"}, {"title": "Covid-19: Ireland closes nightclubs and tightens Covid rules", "content": "Image source, Press Association/Julien Behal\r\nImage caption, Micheál Martin said the risks of going into the Christmas period without some further restrictions was \"just too high\"\r\nIrish nightclubs a… [+6180 chars]", "url": "https://www.bbc.co.uk/news/world-europe-59517114"}, {"title": "Covid-19 Boosters for All Are On the Way", "content": "Federal health officials are expected to sanction covid-19 boosters for most Americans this weeka decision thats become well-supported by the science. While the original shots still provide plenty of… [+5217 chars]", "url": "https://gizmodo.com/covid-19-boosters-for-all-are-on-the-way-1848085296"}, {"title": "Minnesota Calls Up National Guard as Covid-19 Overwhelms Hospitals", "content": "The governor of Minnesota, Tim Walz, has called up the National Guard to assist long term care facilities, as the state struggles with a huge surge in covid-19 hospitalizations that has overwhelmed t… [+2779 chars]", "url": "https://gizmodo.com/minnesota-calls-up-national-guard-as-covid-19-overwhelm-1848108187"}, {"title": "In photos: US borders reopen after Covid-19 travel ban", "content": "Alison Henry embraces her son Liam in New York after a flight arrived from the United Kingdom on Monday, November 8.\r\nUpdated 2:18 PM ET, Tue November 9, 2021\r\nAlison Henry embraces her son Liam in N… [+419 chars]", "url": "https://www.cnn.com/2021/11/09/us/gallery/us-borders-reopen-international-travelers/index.html"}, {"title": "US imposes travel restrictions over new Covid-19 variant", "content": "Dutch health authorities said that the Omicron variant had been identified in at least 13 people who got tested at Amsterdam Schiphol airport after landing from South Africa on Friday.\r\nNetherlands N… [+1575 chars]", "url": "https://www.cnn.com/world/live-news/new-covid-variant-south-africa-11-28-21/index.html"}, {"title": "Mounting evidence highlights the importance of Covid-19 boosters", "content": "(CNN)As the world learns more about the Omicron coronavirus variant and Delta continues to cause Covid-19 cases to rise around much of the United States, the need for booster shots becomes clearer th… [+8433 chars]", "url": "https://www.cnn.com/2021/12/08/health/pfizer-booster-data-omicron-vaccinated-definition/index.html"}, {"title": "Germany Reports New Record of 50,000 Covid-19 Cases in Single Day", "content": "Germany reported 50,196 new cases of covid-19 on Thursday during the previous 24 hours, the highest daily case count for the country for the entire pandemic, according to Germanys DW news outlet. Thu… [+1994 chars]", "url": "https://gizmodo.com/germany-reports-new-record-of-50-000-covid-19-cases-in-1848037834"}, {"title": "U.S. Senate Votes to Block President Biden's Vaccine Mandate in Symbolic Win for Covid-19", "content": "The U.S. Senate voted late Wednesday to block President Joe Bidens proposed covid-19 vaccine mandate for private businesses, a move thats largely seen as symbolic since the Democratic-controlled Hous… [+2466 chars]", "url": "https://gizmodo.com/u-s-senate-votes-to-block-president-bidens-vaccine-man-1848184042"}, {"title": "Brazil reports 10250 coronavirus cases and 274 COVID-19 deaths in 24 hours -ministry - Reuters", "content": "A man receives a dose of the Pfizer-BioNTech coronavirus disease (COVID-19) vaccine at the Bus Rapid Transit (BRT) station in Rio de Janeiro, Brazil October 27, 2021. REUTERS/Pilar OlivaresBRASILIA, … [+839 chars]", "url": "https://www.reuters.com/world/americas/brazil-reports-10250-coronavirus-cases-274-covid-19-deaths-24-hours-ministry-2021-12-07/"}, {"title": "Biden administration plans to announce purchase of Pfizer's experimental Covid-19 antiviral pill", "content": "(CNN)The Biden administration plans to purchase 10 million doses of Pfizer's experimental antiviral Covid-19 pill and is finalizing the contract now, according to a source familiar with the plans. \r\n… [+283 chars]", "url": "https://www.cnn.com/2021/11/16/politics/pfizer-covid-antiviral-pill-biden-administration-purchase/index.html"}, {"title": "How to prepare for another winter of Covid-19? An expert weights in", "content": "(CNN)Winter is almost here. After weeks of steady decline, Covid-19 cases appear to be on the rise again. \r\nIs a surge inevitable? How should families think about the winter ahead? What can they do t… [+5544 chars]", "url": "https://www.cnn.com/2021/11/18/health/winter-covid-precautions-dr-wen-wellness/index.html"}, {"title": "The Guardian: Trump tested positive for Covid-19 ahead of 2020 debate with Biden", "content": "(CNN)Then-President Donald Trump tested positive for Covid-19 three days ahead of his first 2020 presidential debate with Joe Biden -- though he also had a negative result in that same timeframe, acc… [+5282 chars]", "url": "https://www.cnn.com/2021/12/01/politics/trump-covid-positive-test-biden-debate/index.html"}, {"title": "NIH director: New Covid-19 variant 'ought to redouble' vaccination and mitigation efforts", "content": "Washington (CNN)The director of the National Institutes of Health stressed Sunday that a newly emerged coronavirus variant \"ought to redouble\" vaccination efforts and other mitigation strategies, say… [+1404 chars]", "url": "https://www.cnn.com/2021/11/28/politics/francis-collins-omicron-coronavirus-variant-cnntv/index.html"}, {"title": "NHL postpones upcoming New York Islanders games due to Covid-19 outbreak", "content": "(CNN)New York Islanders games have been postponed through at least Tuesday due to a Covid-19 outbreak within the team, the National Hockey League (NHL) announced on Saturday.\r\n\"As a result of an addi… [+1486 chars]", "url": "https://www.cnn.com/2021/11/27/sport/nhl-covid-outbreak-postponement-new-york-islanders-games-spt/index.html"}, {"title": "Covid-19 cases in children are up 32% from two weeks ago, pediatricians' group says", "content": "(CNN)Covid-19 cases in children are up 32% from two weeks ago, according to new numbers published Monday by the American Academy of Pediatrics.\r\nFor the week ending November 18, there were at least 1… [+3312 chars]", "url": "https://www.cnn.com/2021/11/22/health/covid-19-children-cases-up-again/index.html"}, {"title": "Opinion: How to fight Covid-19 while the scientists wait for answers on Omicron", "content": "Syra Madad, DHSc, MSc, MCP is an infectious disease epidemiologist, senior director of the system-wide special pathogens program at NYC Health + Hospitals, health and safety lead at the Enhanced Inve… [+6468 chars]", "url": "https://www.cnn.com/2021/11/29/opinions/fighting-omicron-variant-madad-glanville/index.html"}, {"title": "COVID-19 Bulletin #533 - news.gov.mb.ca", "content": "November 29, 2021\r\nNo cases of the B.1.1.529 (omicron) variant have been detected in Manitoba at this time and the province can confirm that all positive travel-related specimens are being sequenced.… [+5577 chars]", "url": "https://news.gov.mb.ca/news/index.html?item=52783&posted=2021-11-29"}, {"title": "COVID-19 Bulletin #534 - news.gov.mb.ca", "content": "December 1, 2021\r\nNo cases of the B.1.1.529 (omicron) variant have been detected in Manitoba at this time and the province can confirm that all positive travel-related specimens are being sequenced.\r… [+6623 chars]", "url": "https://news.gov.mb.ca/news/index.html?archive=&item=52790"}, {"title": "COVID-19 Bulletin #534 - news.gov.mb.ca", "content": "December 1, 2021\r\nNo cases of the B.1.1.529 (omicron) variant have been detected in Manitoba at this time and the province can confirm that all positive travel-related specimens are being sequenced.\r… [+6623 chars]", "url": "https://news.gov.mb.ca/news/index.html?item=52790&posted=2021-12-01"}]